{
	// ref: https://learn.microsoft.com/en-us/windows/package-manager/winget/import#json-schema
	"$schema": "https://aka.ms/winget-packages.schema.2.0.json",
	"Sources": [
		{
			"Packages": [
				// use beta versions if available
				{
					"PackageIdentifier": "Google.Chrome.Beta"
				},
				{
					"PackageIdentifier": "Discord.Discord.Canary"
				},
				{
					"PackageIdentifier": "Discord.Discord.PTB"
				},
				{
					"PackageIdentifier": "Notion.Notion"
				},
				{
					"PackageIdentifier": "Zoom.Zoom"
				},
				{
					"PackageIdentifier": "Microsoft.PowerToys"
				},
				{
					"PackageIdentifier": "Microsoft.PowerShell.Preview"
				},
				{
					// cspell:ignore termius
					"PackageIdentifier": "Termius.Termius"
				},
				{
					"PackageIdentifier": "Microsoft.Edit"
				},
				{
					"PackageIdentifier": "Microsoft.VisualStudioCode.Insiders"
				},
				{
					"PackageIdentifier": "JetBrains.Toolbox"
				},
				{
					"PackageIdentifier": "Figma.Figma"
				},
				{
					"PackageIdentifier": "Google.GoogleDrive"
				},
				{
					"PackageIdentifier": "TheDocumentFoundation.LibreOffice"
				},
				{
					"PackageIdentifier": "GIMP.GIMP.Nightly"
				},
				{
					// cspell:ignore inkscape
					"PackageIdentifier": "Inkscape.Inkscape"
				},
				{
					"PackageIdentifier": "Cloudflare.Warp"
				},
				{
					// cspell:ignore tailscale
					"PackageIdentifier": "tailscale.tailscale"
				},
				{
					"PackageIdentifier": "CrystalDewWorld.CrystalDiskInfo.AoiEdition"
				},
				{
					"PackageIdentifier": "Valve.Steam"
				},
				{
					"PackageIdentifier": "Logitech.OptionsPlus"
				}
			],
			"SourceDetails": {
				"Argument": "https://cdn.winget.microsoft.com/cache",
				// cspell:ignore 8wekyb3d8bbwe
				"Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
				"Name": "winget",
				"Type": "Microsoft.PreIndexed.Package"
			}
		}
	]
}
